### Dask Array

In [2]:
import dask.array as da    

#using arange to create an array with values from 0 to 10
X = da.arange(11, chunks=5)
print(X.compute())

#to see size of each chunk
print(X.chunks)

[ 0  1  2  3  4  5  6  7  8  9 10]
((5, 5, 1),)

In [4]:
X

dask.array<arange, shape=(11,), dtype=int32, chunksize=(5,), chunktype=numpy.ndarray>

In [3]:
import numpy as np
import dask.array as da
x = np.arange(10)
y = da.from_array(x, chunks=5)
y.compute() #results in a dask array

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [11]:
import numpy as np
import dask.array as da

x = np.arange(1000)  #arange is used to create array on values from 0 to 1000
%time x.mean()
y = da.from_array(x, chunks=(100))  #converting numpy array to dask array

%time y.mean().compute()  #computing mean of the array

CPU times: total: 0 ns
Wall time: 0 ns
CPU times: total: 0 ns
Wall time: 4.94 ms

499.5

### Dask Dataframe

In [23]:
import os
print(os.getcwd())

c:\Users\spurusho\Downloads\NLP\Dask

In [22]:
import os
print(os.path.exists("..\\Dask\\train_oSwQCTC\\train.csv"))

True

In [25]:
base_dir = "Dask"
sub_dir = "train_oSwQCTC"
file_name = "train.csv"

# Create the full path using os.path.join()
file_path = os.path.join('..', base_dir, sub_dir, file_name)

# Now use this path in your code
import pandas as pd
%time temp = pd.read_csv(file_path)

CPU times: total: 219 ms
Wall time: 534 ms

In [110]:
#reading the file using dask
import dask.dataframe as dd
%time df = dd.read_csv(file_path)

CPU times: total: 15.6 ms
Wall time: 13.7 ms

### Look as the time, mind blowing!!!

In [111]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [112]:
df.shape

(<dask_expr.expr.Scalar: expr=ReadCSV(16f2320).size() // 12, dtype=int32>, 12)

In [113]:
df.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [114]:
df['Gender'].value_counts().compute()

Gender
F    135809
M    414259
Name: count, dtype: int64

In [115]:
df.groupby(df.Gender)['Purchase'].max().compute()

Gender
F    23959
M    23961
Name: Purchase, dtype: int64

In [116]:
df.isna().sum().compute()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64

In [117]:
df['Product_ID'].unique().compute()

0       P00069042
1       P00248942
2       P00087842
3       P00085442
4       P00285442
          ...
3626    P00375436
3627    P00372445
3628    P00370293
3629    P00371644
3630    P00370853
Name: Product_ID, Length: 3631, dtype: object

In [118]:
df['Age'].unique().compute()

0     0-17
1      55+
2    26-35
3    46-50
4    51-55
5    36-45
6    18-25
Name: Age, dtype: object

In [119]:
df['Occupation'].unique().compute()

0     10
1     16
2     15
3      7
4     20
5      9
6      1
7     12
8     17
9      0
10     3
11     4
12    11
13     8
14    19
15     2
16    18
17     5
18    14
19    13
20     6
Name: Occupation, dtype: int64

In [120]:
df['City_Category'].unique().compute()

0    A
1    C
2    B
Name: City_Category, dtype: object

In [121]:
df['Stay_In_Current_City_Years'].unique().compute()

0     2
1    4+
2     3
3     1
4     0
Name: Stay_In_Current_City_Years, dtype: object

In [122]:
df['Marital_Status'].unique().compute()

0    0
1    1
Name: Marital_Status, dtype: int64

In [123]:
df['Product_Category_1'].unique().compute()

0      3
1      1
2     12
3      8
4      5
5      4
6      2
7      6
8     14
9     11
10    13
11    15
12     7
13    16
14    18
15    10
16    17
17     9
18    20
19    19
Name: Product_Category_1, dtype: int64

In [124]:
df['Product_Category_2'].unique().compute()

0      NaN
1      6.0
2     14.0
3      2.0
4      8.0
5     15.0
6     16.0
7     11.0
8      5.0
9      3.0
10     4.0
11    12.0
12     9.0
13    10.0
14    17.0
15    13.0
16     7.0
17    18.0
Name: Product_Category_2, dtype: float64

In [125]:
df['Product_Category_2'].unique().compute()

0      NaN
1      6.0
2     14.0
3      2.0
4      8.0
5     15.0
6     16.0
7     11.0
8      5.0
9      3.0
10     4.0
11    12.0
12     9.0
13    10.0
14    17.0
15    13.0
16     7.0
17    18.0
Name: Product_Category_2, dtype: float64

In [126]:
df.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [127]:
df['User_ID'][0].compute()

1000001

In [128]:
df[df['Product_ID'] == df['Product_ID'][0].compute()].compute()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
825,1000149,P00069042,M,26-35,1,B,2,1,3,NaN,NaN,10715
3314,1000541,P00069042,F,18-25,4,C,3,0,3,NaN,NaN,11037
4224,1000698,P00069042,M,18-25,4,A,1,0,3,NaN,NaN,8009
5864,1000951,P00069042,M,46-50,2,B,4+,1,3,NaN,NaN,13346
...,...,...,...,...,...,...,...,...,...,...,...,...
539484,1005061,P00069042,F,18-25,19,C,2,1,3,NaN,NaN,13483
540849,1005284,P00069042,M,26-35,16,C,1,0,3,NaN,NaN,10895
543419,1005667,P00069042,M,36-45,7,B,1,1,3,NaN,NaN,11047
544454,1005812,P00069042,F,26-35,7,A,1,1,3,NaN,NaN,13557
545219,1005938,P00069042,M,26-35,1,C,1,1,3,NaN,NaN,13241

In [129]:
df[['Product_Category_1','Product_Category_2', 'Product_Category_3']].compute()

        Product_Category_1  Product_Category_2  Product_Category_3
0                        3                 NaN                 NaN
1                        1                 6.0                14.0
2                       12                 NaN                 NaN
3                       12                14.0                 NaN
4                        8                 NaN                 NaN
...                    ...                 ...                 ...
550063                  20                 NaN                 NaN
550064                  20                 NaN                 NaN
550065                  20                 NaN                 NaN
550066                  20                 NaN                 NaN
550067                  20                 NaN                 NaN

[550068 rows x 3 columns]

In [130]:
df = df.drop(columns=['User_ID', 'Product_ID'], axis=1).compute()

In [131]:
df.columns

Index(['Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [132]:
df.head()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [133]:
len(df)

550068

In [134]:
data = df

In [136]:
df_combined = df[['Product_Category_1', 'Product_Category_2', 'Product_Category_3']].fillna(0).astype(int)

In [137]:
# Step 2: Use pd.get_dummies() to perform one-hot encoding
# This applies one-hot encoding to each column separately
df_one_hot = pd.get_dummies(df_combined, columns=['Product_Category_1', 'Product_Category_2', 'Product_Category_3'], prefix='', prefix_sep='')

In [138]:
# Step 3: Aggregate the columns to merge one-hot encoded features for the same category
df_one_hot = df_one_hot.groupby(lambda x: x.split('_')[-1], axis=1).sum()

C:\Users\spurusho\AppData\Local\Temp\ipykernel_30632\270584816.py:2: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  df_one_hot = df_one_hot.groupby(lambda x: x.split('_')[-1], axis=1).sum()

In [139]:
# Step 4: Optional - Adjust column names to reflect that these represent categories
df_one_hot.columns = [f'Category_{col}' for col in df_one_hot.columns]

In [140]:
df_one_hot

,Category_0,Category_1,Category_10,Category_11,Category_12,Category_13,Category_14,Category_15,Category_16,Category_17,...,Category_19,Category_2,Category_20,Category_3,Category_4,Category_5,Category_6,Category_7,Category_8,Category_9
0,2,0,0,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0
1,0,1,0,0,0,0,1,0,0,0,...,0,0,0,0,0,0,1,0,0,0
2,2,0,0,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1,0,0,0,1,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,2,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
550063,2,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
550064,2,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
550065,2,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
550066,2,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
550067,2,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0

## write one hot encoder is ready to mixed with our dataset, lets do it

In [142]:
# Merging the two DataFrames side by side
df_merged = dd.concat([df, df_one_hot], axis=1)

In [144]:
df_merged.compute()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,...,Category_19,Category_2,Category_20,Category_3,Category_4,Category_5,Category_6,Category_7,Category_8,Category_9
0,F,0-17,10,A,2,0,3,NaN,NaN,8370,...,0,0,0,1,0,0,0,0,0,0
1,F,0-17,10,A,2,0,1,6.0,14.0,15200,...,0,0,0,0,0,0,1,0,0,0
2,F,0-17,10,A,2,0,12,NaN,NaN,1422,...,0,0,0,0,0,0,0,0,0,0
3,F,0-17,10,A,2,0,12,14.0,NaN,1057,...,0,0,0,0,0,0,0,0,0,0
4,M,55+,16,C,4+,0,8,NaN,NaN,7969,...,0,0,0,0,0,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
550063,M,51-55,13,B,1,1,20,NaN,NaN,368,...,0,0,1,0,0,0,0,0,0,0
550064,F,26-35,1,C,3,0,20,NaN,NaN,371,...,0,0,1,0,0,0,0,0,0,0
550065,F,26-35,15,B,4+,1,20,NaN,NaN,137,...,0,0,1,0,0,0,0,0,0,0
550066,F,55+,1,C,2,0,20,NaN,NaN,365,...,0,0,1,0,0,0,0,0,0,0
550067,F,46-50,0,B,4+,1,20,NaN,NaN,490,...,0,0,1,0,0,0,0,0,0,0

In [151]:
df_merged.head()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,...,Category_19,Category_2,Category_20,Category_3,Category_4,Category_5,Category_6,Category_7,Category_8,Category_9
0,F,0-17,10,A,2,0,3,NaN,NaN,8370,...,0,0,0,1,0,0,0,0,0,0
1,F,0-17,10,A,2,0,1,6.0,14.0,15200,...,0,0,0,0,0,0,1,0,0,0
2,F,0-17,10,A,2,0,12,NaN,NaN,1422,...,0,0,0,0,0,0,0,0,0,0
3,F,0-17,10,A,2,0,12,14.0,NaN,1057,...,0,0,0,0,0,0,0,0,0,0
4,M,55+,16,C,4+,0,8,NaN,NaN,7969,...,0,0,0,0,0,0,0,0,1,0

In [152]:
df_merged = df_merged.drop(['Product_Category_1', 'Product_Category_2', 'Product_Category_3'], axis=1)

### So,label encoder : Gender, 
### onehotencoder : Age, City_category, Stay_In_Current_City_Years,

### Dask ML

In [ ]:
from dask.distributed import Client 
client = Client() # start a local Dask client

In [ ]:
import dask_ml.joblib
from sklearn.externals.joblib import parallel_backend
with parallel_backend('dask'):
    # Your normal scikit-learn code here
     from sklearn.ensemble import RandomForestClassifier 
     model = RandomForestClassifier()